# Иван Васильевич пришел на рынок и решил купить
# два арбуза: один для себя, а другой для тещи.
# Понятно, что для себя нужно выбрать арбуз потяжелей,
# а для тещи полегче. Но вот незадача: арбузов слишком
# много и он не знает как же выбрать самый легкий
# и самый тяжелый арбуз? Помогите ему!

# Пользователь вводит одно число N – количество арбузов.
# Вторая строка содержит N чисел, записанных на новой
# строчке каждое. Здесь каждое число – это масса соответствующего арбуза

N = int(input("Введи число: "))
minimum = 1000
maximum = 0
for i in range(N):
    massa = int(input('масса арбуза: '))
    if massa <= minimum:
        minimum = massa
    if massa >= maximum:
        maximum = massa
print(minimum, maximum)
